---
kind: other
id: Methods.T:Autodesk.Revit.DB.Macros.ApplicationEntryPoint
source: html/926cd54a-097e-b13b-a33d-a281fb96530d.htm
---
# ApplicationEntryPoint Methods

Copies an existing model to a new file. Overwriting a file of the same name is allowed.